{
  "posts": [
    {
      "date": "01/04/2014",
      "subtitle": " A basic class for an easily subsetable dictionary using Python's <a href=\"http://docs.python.org/2/library/collections.html#namedtuple-factory-function-for-tuples-with-named-fields\">namedtuple</a> as keys for multidimensional indexing",
      "title": "Indexing with namedtuple",
      "filename" : "indexing-with-named-tuple"
    },
    {
      "date": "12/03/2013",
      "subtitle": "Investigating a few \"Pythonic\" ways to calculate gradients across given input colors",
      "title": "Color gradients with Python",
      "filename" : "color-gradients-with-python"
    },
    {
      "date": "10/01/2013",
      "subtitle": "Data analysis, LaTeX source generation, and pdf report compiling all in a single Stata .do file",
      "title": "Dynamic reports with \"StaTeX\"",
      "filename" : "dynamic-reports-with-statex"
    },
    {
      "date": "09/01/2013",
      "subtitle": "Random walk data generation and plotting in R<sup>3</sup>",
      "title": "10 million steps with R",
      "filename" : "10-million-steps-with-R"
    }
  ],
  "pubs": [
      {
        "abstract": "This paper examines 12,887 individual eBay, english-style, completed auctions of the Otterbox Defender iPhone 4/4S cell-phone case over a 90 day period, with sales and purchases occuring in both the USA and Canada, all collected from Terapeak.com. Findings suggest quick reversion of cross-border prices to parity. Specifically the half-life of deviations is estimated to be 10.34 hours. With this evidence in mind, eBay appears ever closer to an Economist’s ideal marketplace, with limited price friction, large numbers of informed buyers and sellers, and low barriers to entry.",
        "authors": "Ben Southgate",
        "date": "(05.01.14)",
        "url": "http://www.michiganjb.org/issues/71/MJB%20-%20provisional%20Southgate%20paper.pdf",
        "org": "Michigan Journal of Business",
        "org_url": "http://www.michiganjb.org/",
        "title": "LOOP and the Internet Marketplace"
      },
      {
        "abstract": "To address chronic underfunding problems, the Louisiana state legislature replaced the traditional pension for state government employees with a cash balance plan, but the courts invalidated the measure. This report assesses how employees would fare under that reform. Results show that a slight majority would do worse in the cash balance plan than the existing plan, but about three-fourths would fare better under an alternative reform that extends Social Security to state employees and provides a smaller cash balance plan.",
        "authors": "Owen Haaga, Richard W. Johnson, and Benjamin G. Southgate",
        "date": "(06.16.15)",
        "url": "http://www.urban.org/research/publication/state-public-pension-reform-louisiana",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "The State of Public Pension Reform in Louisiana"
      },
      {
        "abstract": "This brief, drawn from a longer report, shows how state and local government employees in Louisiana would likely fare in a cash balance retirement plan that was enacted by the state legislature but invalidated by the courts. Results show that a slight majority of state employees would do worse in the cash balance plan than the existing traditional defined benefit plan. However, about three-fourths would fare better under an alternative reform that extends Social Security to state employees and provides a smaller cash balance plan.",
        "authors": "Owen Haaga, Richard W. Johnson, and Benjamin G. Southgate",
        "date": "(06.04.15)",
        "url": "http://www.urban.org/research/publication/cash-balance-plan-right-choice-louisiana-state-employees",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Is a Cash Balance Plan the Right Choice for Louisiana State Employees?"
      },
      {
        "abstract": "Between 2002 and 2012, contributions by New York’s state and local governments to public employee retirement plans rose more than 500 percent, squeezing budgets for municipalities across the state. This surge was driven primarily by investment losses as well as the plan’s practice of adjusting government contributions to offset unexpected investment gains and losses. The plan benefit structure was not the culprit. Although current retirees from New York’s state and local governments receive more generous pensions than government employees in most states, recent cutbacks have significantly reduced pensions for new hires. Further benefit cuts do not seem warranted.",
        "authors": "Richard W. Johnson, Owen Haaga, and Benjamin G. Southgate",
        "date": "(06.04.15)",
        "url": "http://www.urban.org/research/publication/why-have-government-contributions-new-york-pension-plans-soared-2010",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Why Have Government Contributions to New York Pension Plans Soared since 2010?"
      },
      {
        "abstract": "Financial problems have led to significant pension cuts for Illinois public school teachers. An alternative approach would be to replace the existing traditional defined benefit plan with a cash balance plan, which combines features of 401(k)-type plans and traditional pensions. Our simulations show that 72 percent of Illinois public school teachers hired before 2011—and 56 percent of those with five or more years of completed service—would fare better in the simulated cash balance plan than the existing plan, even though the cash balance plan would be no more costly to taxpayers.",
        "authors": "Richard W. Johnson and Benjamin G. Southgate",
        "date": "(04.06.15)",
        "url": "http://www.urban.org/research/publication/could-cash-balance-plan-benefit-illinois-public-school-teachers",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Could a Cash Balance Plan Benefit Illinois Public School Teachers?"
      },
      {
        "abstract": "California teacher pensions vary widely depending on when teachers begin their careers and how long they teach. Teachers who spend their entire careers in the plan receive large pensions. However, teachers who join the plan at relatively young ages and spend less than full careers in the classroom accumulate few retirement benefits, and those benefits are often worth less than the value of the teachers’ required plan contributions. As policymakers address the California teacher pension plan’s funding problems, they should consider altering the plan’s benefit formula to more equitably distribute pension benefits across the workforce.",
        "authors": "Richard W. Johnson and Benjamin G. Southgate",
        "date": "(04.06.15)",
        "url": "http://www.urban.org/research/publication/are-california-teacher-pensions-distributed-fairly",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Are California Teacher Pensions Distributed Fairly?"
      },
      {
        "abstract": "The California State Teachers’ Retirement System has been grossly underfunded for the past decade. State policymakers have responded by cutting plan benefits for new hires and raising teachers’ required plan contributions. These changes, however, have undermined teachers’ retirement income security. Only 35 percent of new hires will receive pensions worth more than the value of their required plan contributions. Most new hires would have better financial outcomes if they could opt out of the mandatory retirement plan and invest their contributions elsewhere. Additional plan reforms should focus on changing the benefit formula to distribute pensions more equitably across the workforce.",
        "authors": "Richard W. Johnson and Benjamin G. Southgate",
        "date": "(12.05.14)",
        "url": "http://www.urban.org/research/publication/can-california-teacher-pensions-be-distributed-more-fairly",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Can California Teacher Pensions Be Distributed More Fairly?"
      },
      {
        "abstract": "The financial problems afflicting Illinois’s teacher pension plan have grabbed headlines. An equally important problem, though underappreciated, is that relatively few teachers benefit much from the plan. Long-serving teachers receive generous pensions, but only 18 percent of teachers remain employed for at least 25 years. Only 24 percent of those who complete at least five years of service receive pensions worth more than the value of their required plan contributions. Alternative plan designs, such as cash balance plans, could distribute benefits more equitably and put more teachers on a path to a financially secure retirement.",
        "authors": "Richard W. Johnson and Benjamin G. Southgate",
        "date": "(07.30.14)",
        "url": "http://www.urban.org/publications/413196.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Evaluating Retirement Income Security for Illinois Public School Teachers"
      },
      {
        "abstract": "In 2011 Rhode Island replaced the stand-alone defined benefit pension plan it provided to state employees with a hybrid plan that reduced the defined benefit component and added a 401(k)-type, defined contribution component. Although controversial, the new hybrid plan will boost retirement incomes for most of the state’s public school teachers. Our simulations show that two-thirds of newly hired teachers will earn more retirement benefits under the hybrid plan they would have earned under the old plan. Defined contribution plans—the dominant employer-sponsored retirement plan in the private sector—can play an important role in the reform of public-sector pensions.",
        "authors": "Richard W. Johnson, Barbara Butrica, Owen Haaga, Benjamin G. Southgate",
        "date": "(05.30.14)",
        "url": "http://www.urban.org/publications/413137.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "How Will Rhode Island's New Hybrid Pension Plan Affect Teachers?"
      },
      {
        "abstract": "Kentucky recently replaced its traditional pension with a new cash balance plan for state and county employees hired after 2013. Employees who join the government payroll at relatively young ages and remain for no more than 25 years will accumulate more benefits in the cash balance plan than the traditional plan, while many of those with more years of service and hired at older ages will accumulate less. More than half of employees hired in 2014 who complete at least five years of service will fare better in the cash balance plan, which distributes benefits more evenly across the workforce.",
        "authors": "Richard Johnson and Ben Southgate",
        "date": "(04.30.14)",
        "url": "http://www.urban.org/publications/413105.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "How Will State and County Government Employees Fare under Kentucky's New Cash Balance Pension Plan?"
      },
      {
        "abstract": "Traditional defined benefit pension plans that cover nearly all state and local government employees generally penalize work at older ages. In more than three-fifths of state-administered plans, employees hired at age 25 will receive lower lifetime pension benefits if they continue working after age 57 because retirement-eligible workers cannot receive benefit checks while they remain on the job. This reduction in benefits can create strong retirement incentives, which are hard to justify as the population ages and health gains and declines in physical work enable more older people to work. Well-designed public pension reforms could eliminate these work disincentives.",
        "authors": "Richard W. Johnson, Barbara Butrica, Owen Haaga, Benjamin G. Southgate",
        "date": "(04.30.14)",
        "url": "http://www.urban.org/publications/413106.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "When Do State and Local Pension Plans Encourage Workers to Retire?"
      },
      {
        "abstract": "Traditional defined benefit pension plans that cover nearly all state and local government employees generally provide generous retirement benefits to long-tenured public servants but little retirement security to those with shorter tenures. Virtually every plan requires employee contributions. In half of those plans, employees must work at least 20 years before their future benefits are worth more than those contributions. Employees who separate earlier get nothing from their plan. Alternative designs like cash balance plans distribute benefits more equally across the workforce and allow employees who spend less than a full career in public service to accumulate retirement benefits.",
        "authors": "Richard W. Johnson, Barbara Butrica, Owen Haaga, Benjamin G. Southgate",
        "date": "(04.30.14)",
        "url": "http://www.urban.org/publications/413107.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "How Long Must State and Local Employees Work to Accumulate Pension Benefits?"
      },
      {
        "abstract": "State and local pension plans often allow employees who have completed 25 or 30 years of service to collect benefits regardless of their age, instead of waiting until they reach their plan’s normal retirement age. The lifetime value of their pension surges when they qualify for early benefits. Our analysis shows that on average, half the benefits employees have accumulated by their early 50s or late 40s are earned from a single year of work. These patterns create strong incentives for mid-career workers to remain on the payroll until they realize these windfalls, including those ill-suited for their jobs.",
        "authors": "Richard W. Johnson, Barbara Butrica, Owen Haaga, Benjamin G. Southgate",
        "date": "(04.30.14)",
        "url": "http://www.urban.org/publications/413108.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Do State and Local Pensions Lock In Mid-Career Employees?"
      },
      {
        "abstract": "This data brief reports quarterly labor force statistics for older Americans, a growing segment of the workforce. It reports labor force participation rates, unemployment rates, employment-to-population ratios, and the share of unemployed workers who have been out of work for more than six months, and compares outcomes to earlier years. Labor market outcomes did not improve much for older or younger workers in the third quarter of 2013. Older workers continue to fare better than their younger counterparts, although older unemployed adults take longer to find work.",
        "authors": "Richard W. Johnson and Benjamin G. Southgate",
        "date": "(01.24.14)",
        "url": "http://www.urban.org/publications/412999.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Labor Force Statistics on Older Americans, Third Quarter 2013"
      },
      {
        "abstract": "This data brief reports quarterly labor force statistics for older Americans, a growing segment of the workforce. It reports labor force participation rates, unemployment rates, employment-to-population ratios, and the share of unemployed workers who have been out of work for more than six months, and compares outcomes to earlier years. Labor market outcomes did not improve much for older or younger workers in the second quarter of 2013. Older workers continue to fare better than their younger counterparts, although older unemployed adults take longer to find work.",
        "authors": "Richard W. Johnson and Benjamin G. Southgate",
        "date": "(07.30.13)",
        "url": "http://www.urban.org/publications/412878.html",
        "org": "Urban Institute",
        "org_url": "http://www.urban.org",
        "title": "Labor Force Statistics on Older Americans, Third Quarter 2013"
      }
  ],
  "viz": [
    {
      "url" : "http://www.theatlantic.com/business/archive/2015/03/laughter-in-fed-transcripts/388027/",
      "title": "Laughing All the Way to the Crash",
      "image": "/static/images/funnyfed.png"
    },
    {
      "url" : "http://datatools.urban.org/features/mapping-americas-futures",
      "title" : "Mapping America's Futures",
      "image" : "/static/images/MAF.png"
    },
    {
      "url" : "http://datatools.urban.org/features/build-your-own-pension",
      "title" : "Build Your Own Pension Plan",
      "image" : "/static/images/build-your-own-pension.png"
    },
    {
      "url" : "http://datatools.urban.org/Features/domestic-violence-data/dataviz/",
      "title" : "Vizualizing Gaps in Domestic Violence Data",
      "image" : "/static/images/datadive.png"
    },
    {
      "url" : "http://datatools.urban.org/features/bsouthga/crimeplot/",
      "title" : "Crimes in US Cities",
      "image" : "/static/images/crimeplot.png"
    },
    {
      "url" : "http://datatools.urban.org/features/everydayviolence/",
      "title" : "Gun Violence in Washington DC",
      "image" : "/static/images/everydayviolence.png"
    },
    {
      "url" : "http://blog.metrotrends.org/2014/08/higher-minimum-wages-improve-economic-well-being-dc/",
      "title" : "Minimum Wage Meta-analysis",
      "image" : "/static/images/metaanalysis.png"
    },
    {
      "url" : "http://datatools.urban.org/features/slepp/",
      "title" : "SLEPP Report Card",
      "image" : "/static/images/slepp.png"
    }
  ]
}